b = int(input("Здравствуйте! Введите значения первого элемента геометрической прогрессии: ")) # первый член прогрессии
q = int(input("Введите шаг геометрической прогрессии: ")) # шаг прогрессии
n = int(input("Введите номер последнего элемента: ")) # порядковый номер последнего элемента прогрессии
if (-10_000 <= b <= 10_000) and (1 <= q <= 50) and (2 <= n <= 100) and (q != 1):
    flag = True
    Summa = int(b*(1-q**n)/(1-q)) # формула суммы геометрической прогрессии
    print(f"Сумма геометрической прогрессии: {Summa}") # Вывод ответа
else:
    flag = False
    print("Введенные данные не входят в диапазон значиний данных или q=0 :(")