n = int(input("Введите пожалуйста число и мы узнаем, является ли оно простым или нет: ")) # нужно ввести абсолютно любое число
if n > 1 and 1 <= n <= 25: # задаем диапазон значений
    flag = True # предположим, что все числа простые
    i = 2 # начинаем проверять с деления на 2
    while i * i <= n: # проверяем делители от 2 до квадратного корня числа
        if n % i == 0: # если n делится на i без остатка, тогда мы нашли делитель и n - составное число
            flag = False # n - не простое число
            break # останавливаем цикл и начинаем заново
        i += 1 # но для следующего i (если первое i было 2, то следующее i будет 3)
    if flag is True: #если число после всех проверок осталось простое
        print("Y") # то выводим на экран "Y"
    else:
        print("N") # А если число не простое, то выводим "N"
else:
    print("N") # если число не входит в диапазон значений числа n, то тоже выводим на экран "N", чего и просит условие задачи.
